TEST1/meshConvergenceStudy/cases/medium/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compInterFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1e-10;

deltaT          1e-15;         // Base time step (1 fs)
maxDeltaT       1e-14;         // Cap adaptive growth (10 fs)
minDeltaT       1e-16;         // Minimum 0.01 fs for precision
writeInterval   1e-14;         // Start with 1 ps intervals

// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;

maxThermalCourant 0.2;         // Increased from 0.02 - allow dt growth! // Reduced from 0.5 for thermal stability
thermalFluxRelax 0.1;          // Stronger damping of interface heat flux
maxCo           0.2;          // Increased from 0.02 - allow dt growth!  // Reduced from 0.5 for stability during thermal transitions
maxAlphaCo      0.3;         // Aggressive interface limit // Reduced from 0.5 interface limit for better interface tracking
maxDi           10;  // Limit interface dilation Courant number

verbose         true;
enableLiftProcessTracker true;

// ADAPTIVE OUTPUT - more frequent during active phase, less during cooling
adjustTimeStep  yes;           // ENABLE adaptive time stepping
writeControl    adjustableRunTime;

purgeWrite      100;            // Keep more time directories for analysis
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;             // Increased precision for longer runs
fileHandler     uncollated;

runTimeModifiable yes;

// EXTENDED PHASE-CHANGE - longer activation for complete process
phaseChangeCoeffs
{
    model               clausius_clapeyron;  // Not temperature window!
    hf                  [0 2 -2 0 0 0 0] 9.1e6;   // J/kg (Ti vaporisation)
    gasConstant         [0 2 -2 -1 0 0 0] 174;    // J/kg/K (Ti vapor)
    Tsol                [0 0 0 1 0 0 0] 1941;     // K (melting point)
    Tvap                [0 0 0 1 0 0 0] 2200;     // K - FIXED: superheated liquid regime                                                   // Not equilibrium boiling (3560K)!
                                                  // Zhigilei: surface evaporation > 2000K
                                                   // Will reach ~2200K at t ≈ 0.2ps (end of pulse)
    
    // Kinetic theory parameters
    evaporationCoeff       0.03;     // Ti evaporation coefficient
    alphaMin              0.001;    
    dtFloor             1e-15;         // Reduced for precision
    relaxationTime      1e-11;        // Faster response for femtosecond dynamics
    maxSource           [1 -1 -3 0 0 0 0] 1e22;         // Permit HK flux to sustain the ~80 MPa recoil plateau at 6.6 kK (Feinaeugle et al., Appl. Surf. Sci. 418, 2017)
    minCoefficient      1e6;          // Reduced for gradual cooling
    onlyAboveVapor      false;        // CRITICAL FIX: allow recoil in superheated regime
                                      // Brown et al.: jet formation at 0.5-1ps requires
                                      // recoil starting at Tl < 3560K
    // EXTENDED ACTIVATION - through transfer and cooling
    activationTime      ((0 2e-10));  // Active through 400 ps
}

// EXTENDED MASS TRANSFER - through solidification
massTransferCoeffs
{
    tStart  (0);
    tEnd    (2e-10);   // Active through 400 ps
    rateMax 3e13;      // Needed to ablate the 70 nm Ti film within ~200 ps (Piqué et al., Appl. Phys. A 79, 2004)
}

// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;

// Advanced interface capturing - TUNED FOR EXTENDED SIMULATION
useAdvancedInterfaceCapturing  true;

advancedInterfaceCapturing
{
    model               kinetic_theory;  // Not arbitrary scaling!
    stickingCoeff       0.18;
    momentumAccommodationCoeff       0.18;
    // CRITICAL FIX: Enable recoil in superheated liquid regime
    // Tvap = 2200K, start recoil at Tl > 1900K (just below melting)
    recoilTempOffset      0;            // Code requires non-negative value
                                        // Recoil starts at Tvap = 1941K (melting point) // Ultrafast regime: evaporation begins with melting
    phaseChangeTempOffset 0;
    // Mass flux threshold - RELAXED for fs-LIFT
    massRateEps           1e-6;         // FIXED: was 1e-12 (too restrictive!)
                                        // At 2000K: j ~ 10^3-10^4 kg/m²/s expected
                                        // This allows detection of realistic evaporation
    // Knight (Phys. Rev. B 20, 1979) predicts recoil pressures exceeding
    // 0.3 GPa near 6000 K.  The fs deposition pushes Tl well beyond that, so
    // allow the kinetic-theory recoil driver to reach the multi-GPa recoil
    // levels observed in ultrafast LIFT experiments before clamping.
    recoilMax             3.0e9;
    clampRecoil           false;
    scaleRecoilMax        false;
    recoilRelax           0.5;
    alphaMin              0.001;
    //alphaMax              0.999;
    maxPhysicalTemperature 10000;
    // Physical limits
    // Keep the absolute bound consistent with the multi-GPa recoil required to
    // sustain fs-LIFT expulsion without premature pressure clamping.
    maxRecoilPressure   3.0e9;
}
logRecoilSuppression true;

// Temperature clamping - EXTENDED RANGE
enableTClamp    false;
minT            200;           // Allow cooling below room temp
maxT            10000;          // Keep within measured Ti plume temperatures (~10 kK)

// Two-temperature model properties - OPTIMIZED FOR EXTENDED RUNS
twoTemperatureProperties
{
    // Linear electronic heat capacity: Ce = γTe
    Ce
    {
        type        polynomial;
        value       0;
        coeffs
        (
            (0   0)  // Constant term = 0
            (150 1)  // Linear term: Ce = 630 · Te [J/m³/K²]
        );
    }
    
    // Temperature-dependent coupling
G
{
    type table;
    values
    (
        (300      2.0e17)   // ✓ CORRECT
        (1000     5.0e17)   // ✓ CORRECT
        (2000     1.5e18)   // ✓ CORRECT
        (3000     4.0e18)   // ✓ CORRECT
        (5000     1.5e19)   // ✓ CORRECT
        (10000    8.0e19)   // ✓ CORRECT
        (20000    2.5e20)   // ✓ CORRECT
    );
}
    
    Cl  [1 -1 -2 -1 0 0 0] 2.5e6;
    De  [0  2 -1  0 0 0 0] 1e-4;

    gasMetalExchangeCoeff
    {
        type        kapitza;    // Use acoustic mismatch model
        Z_metal     2.3e7;      // Ti acoustic impedance [Pa·s/m]
        Z_gas       383;        // Ar acoustic impedance [Pa·s/m]
        rho_metal   4500;       // Ti density [kg/m^3]
        rho_gas     1.7;        // Ar density [kg/m^3]
        maxTemperature 0;      // Optional cap [K] (0 => no cap)
    }
    gasMetalCutoffTemperature 2200;
    minMetalFractionForExchange 0.5;
    minGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 1e8;
    maxGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 5e9;
    maxGasMetalHeatFlux    5e9;
    minTe           200;
    maxTe           20000;      // Allow hot electrons
    maxTl           10000;       // Allow Ti lattice to exceed the ≈6.6 kK needed for 80 MPa recoil (Feinaeugle et al., Appl. Surf. Sci. 418, 2017)
    ambientTemperature 300;
    temperatureDifferenceFloor 10.0;                     // ← MISSING (causes singularities)
    // ADAPTIVE MICRO-STEPPING
    electronSubCycles        1;
    minElectronSubCycles     1;
    maxElectronSubCycles     20;     // Fine 2 nm cells need more electron micro-steps increased from 10 to 20
    maxElectronDeltaT        [0 0 1 0 0 0 0] 1e-15;  // Limit to 0.5 fs for stability //reduced from 1e-15 to 5e-16

    nInnerCouplingSweeps         2;  // More coupling iterations
    innerCouplingResidualTol     1e-3; // Enable convergence check
    
    klHighTThreshold 1000;
    klExponent       0.5;

    metalFractionFloor      1e-9;
    metalFractionCutoff     1e-6;
    metalAmbientBlendWidth  1e-3;
    CvolGasFloor            1e6;     // J/m³/K minimum for gas
    
    energyTolerance         0.02;    // Relaxed for long runs
    energyDiagnostics       true;
    temperatureDiagnostics  true;   // Reduce output volume
    energyAudit             true;
}


// Clean monitoring functions
functions
{
    // Mid-plane visualization (optional)
    midPlaneVTK
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        writeInterval   1;
        surfaceFormat   vtk;
        fields          (alpha.metal Tl Te T p_rgh U);

        surfaces
        (
            midPlane
            {
                type                cuttingPlane;
                planeType           pointAndNormal;
                pointAndNormalDict
                {
                    point   (25e-6 2.00357e-05 5e-6);
                    normal  (0 1 0);
                }
                interpolate         true;
            }
        );
    }
}
